{
  "activation_dropout": 0.0,
  "architectures": [
    "BioGptForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "O",
    "1": "B-GENE-Y",
    "2": "I-GENE-Y",
    "3": "B-CHEMICAL",
    "4": "I-CHEMICAL",
    "5": "B-GENE-N",
    "6": "I-GENE-N"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-CHEMICAL": 3,
    "B-GENE-N": 5,
    "B-GENE-Y": 1,
    "I-CHEMICAL": 4,
    "I-GENE-N": 6,
    "I-GENE-Y": 2,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "layerdrop": 0.0,
  "max_position_embeddings": 1024,
  "model_type": "biogpt",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "scale_embedding": true,
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "use_cache": true,
  "vocab_size": 42384
}
