{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-GENE-Y",
    "2": "I-GENE-Y",
    "3": "B-CHEMICAL",
    "4": "I-CHEMICAL",
    "5": "B-GENE-N",
    "6": "I-GENE-N"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-CHEMICAL": 3,
    "B-GENE-N": 5,
    "B-GENE-Y": 1,
    "I-CHEMICAL": 4,
    "I-GENE-N": 6,
    "I-GENE-Y": 2,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
